# StairsDbgShowRunOutlineForPlan Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDbgShowRunOutlineForPlan Property
ParameterTypeId Class See Also
---
"Show Run Outline For Plan"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDbgShowRunOutlineForPlan { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDbgShowRunOutlineForPlan As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDbgShowRunOutlineForPlan {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace